Revit 2024 API
BuiltInFailures.MassFailures.SketchCurveNotModelable Property
 This action cannot be completed. An element created by massing has a sketch line that cannot be modeled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SketchCurveNotModelable { get; }
Visual Basic
Public Shared ReadOnly Property SketchCurveNotModelable As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SketchCurveNotModelable {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace